# Masters' in Applied Artificial Intelligence
## Machine Learning Algorithms Course

Notebooks for MLA course

by [*lufer*](mailto:lufer@ipca.pt)

---

# Datasets on ML Modelling - Part II

**Contents**:

1.   Python essencial
2.   Working with Datasets
3.   **Features Manipulation**
4.   **Cleaning Data**
5.  Data Visualization

## Environment preparation

### Importing necessary Libraries

In [2]:
import pandas as pd
import numpy as np

Mounting Drive

In [ ]:

from google.colab import drive

# it will ask for your google drive credentiaals
drive.mount('/content/gDrive/', force_remount=True)

Mounted at /content/gDrive/

*Loading dataset*

In [3]:
import requests

download_url = "https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv"
target_csv_path = "nbaAll.csv"

#create a local file with remote csv data
response = requests.get(download_url)
response.raise_for_status()
with open(target_csv_path, "wb") as f:
    f.write(response.content)
print("Download ready.")

nba = pd.read_csv("nbaAll.csv")

Download ready.

In [4]:
nba

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,60.309792,GSW,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,68.013329,CLE,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

## 3 - Features Manipulation

In [5]:
#checking dataset structure
nba.shape

(126314, 23)

In [6]:
nba.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

*Filtering columns with "isin"*

In [7]:
nbaYear = nba[nba["year_id"].isin([1948, 1949])]
nbaYear

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
700,351,194711120WSC,NBA,0,1948,11/12/1947,1,0,WSC,Capitols,...,50.173782,BLB,Baltimore,55,1419.0000,1414.4618,H,W,0.717674,NaN
701,351,194711120WSC,NBA,1,1948,11/12/1947,1,0,BLB,Baltimore,...,42.867378,WSC,Capitols,63,1481.0703,1485.6085,A,L,0.282326,NaN
702,352,194711130BLB,NBA,0,1948,11/13/1947,2,0,BLB,Baltimore,...,43.288319,BOS,Celtics,74,1289.9966,1285.9733,H,W,0.784507,NaN
703,352,194711130BLB,NBA,1,1948,11/13/1947,1,0,BOS,Celtics,...,29.691414,BLB,Baltimore,85,1414.4618,1418.4851,A,L,0.215493,NaN
704,353,194711130CHS,NBA,0,1948,11/13/1947,1,0,CHS,Stags,...,45.430969,STB,Bombers,70,1395.4702,1389.6464,H,W,0.688478,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1885,943,194904090WSC,NBA,1,1949,4/9/1949,68,1,MNL,Lakers,...,59.256477,WSC,Capitols,83,1469.5483,1484.5758,A,L,0.606789,NaN
1886,944,194904110WSC,NBA,0,1949,4/11/1949,70,1,WSC,Capitols,...,46.550896,MNL,Lakers,65,1629.8854,1618.4757,H,W,0.435161,NaN
1887,944,194904110WSC,NBA,1,1949,4/11/1949,69,1,MNL,Lakers,...,58.284595,WSC,Capitols,74,1484.5758,1495.9855,A,L,0.564839,NaN
1888,945,194904130LAL,NBA,0,1949,4/13/1949,70,1,MNL,Lakers,...,58.820530,WSC,Capitols,56,1495.9855,1489.7295,H,W,0.782579,at Saint Paul MN
1889,945,194904130LAL,NBA,1,1949,4/13/1949,71,1,WSC,Capitols,...,45.905354,MNL,Lakers,77,1618.4757,1624.7317,A,L,0.217421,at Saint Paul MN

*Get first N columns from a dataframe*

In [8]:
n=3
aux = nba.iloc[:,:n]
#renamedNba
aux

        gameorder       game_id lg_id
0               1  194611010TRH   NBA
1               1  194611010TRH   NBA
2               2  194611020CHS   NBA
3               2  194611020CHS   NBA
4               3  194611020DTF   NBA
...           ...           ...   ...
126309      63155  201506110CLE   NBA
126310      63156  201506140GSW   NBA
126311      63156  201506140GSW   NBA
126312      63157  201506170CLE   NBA
126313      63157  201506170CLE   NBA

[126314 rows x 3 columns]

*Get last N columns from a dataframe*

In [9]:
aux = nba.iloc[:,-3:]
aux

       game_result  forecast notes
0                L  0.640065   NaN
1                W  0.359935   NaN
2                W  0.631101   NaN
3                L  0.368899   NaN
4                L  0.640065   NaN
...            ...       ...   ...
126309           L  0.546572   NaN
126310           W  0.765565   NaN
126311           L  0.234435   NaN
126312           L  0.481450   NaN
126313           W  0.518550   NaN

[126314 rows x 3 columns]

### Deriving new Feature

*Create new Feature (column)*

In [10]:
nba["date_played"] = pd.to_datetime(nba["date_game"])
nba
nba.columns

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes',
       'date_played'],
      dtype='object')

*Create new Feature from calculus over others*

In [11]:
#See https://www.plus2net.com/python/pandas-dt-timedelta64.php
from datetime import date
today = pd.to_datetime(date.today())
nba['DaysCPassed'] = (today-nba['date_played']) / np.timedelta64(1, 'D')
nba.shape

(126314, 25)

In [12]:
nba.DaysCPassed.max()

28208.0

### Change features names

In [13]:
renamedNba = nba.rename(columns={"DaysCPassed": "DaysPassed"})

In [14]:
renamedNba.info()
print('-'*50)
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysPassed     126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysCPassed    126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB

### Deleting Features

*Delete a particular Feature (column)*

In [15]:
df = nba.drop(columns=['C'])
df.shape
df

KeyError: "['C'] not found in axis"

In [17]:
#renamedNba.drop(['C'], inplace=True, axis=1)
renamedNba.info()
print('-'*50)
renamedNba.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysPassed     126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB
--------------------------------------------------

(126314, 25)

### Changing the Data Type of Columns

In [18]:
df = nba.copy()
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysCPassed    126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played,DaysCPassed
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN,1946-11-01,28208.0
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN,1946-11-01,28208.0
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN,1946-11-02,28207.0
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN,1946-11-02,28207.0
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN,1946-11-02,28207.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN,2015-06-11,3149.0
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN,2015-06-14,3146.0
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN,2015-06-14,3146.0
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN,2015-06-16,3144.0
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN,2015-06-16,3144.0

*Convert column types*

In [19]:
nba["date_played"] = pd.to_datetime(nba["date_game"])

*Identify unique values*

In [20]:
a=df["game_location"].unique()
print(a)

['H' 'A' 'N']

*Counting distinct values*

In [21]:
a=df["game_location"].nunique()
a

3

*Occurences*

In [22]:
df['team_id'].value_counts()

BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
INJ      60
PIT      60
DTF      60
TRH      60
SDS      11
Name: team_id, Length: 104, dtype: int64

Make colunms Category type

In [23]:
t= pd.Categorical(nba['team_id'] )

In [24]:
t

['TRH', 'NYK', 'CHS', 'NYK', 'DTF', ..., 'CLE', 'GSW', 'CLE', 'CLE', 'GSW']
Length: 126314
Categories (104, object): ['ANA', 'AND', 'ATL', 'BAL', ..., 'WAT', 'WSA', 'WSB', 'WSC']

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysCPassed    126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB

In [26]:
df["game_location"] = pd.Categorical(df["game_location"])
df["game_location"].dtype

CategoricalDtype(categories=['A', 'H', 'N'], ordered=False)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  category
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysCPassed    126314 non-null  float64
dtypes: category(1), datetime64[ns](1), float64(7), int64(7), object(9)
memory usage: 23.2+ MB

### Aggregations for `DataFrame`

In [28]:
points = nba["pts"]
type(points)
# Expected:
# <class 'pandas.core.series.Series'>

pandas.core.series.Series

In [29]:
points.sum()
# Expected:
# 12976235

12976235

### Grouping

In [30]:
nba.groupby("fran_id", sort=False)["pts"].sum()
# Expected:
# fran_id
# Huskies           3995
# Knicks          582497
# Stags            20398
# Falcons           3797
# Capitols         22387

fran_id
Huskies           3995
Knicks          582497
Stags            20398
Falcons           3797
Capitols         22387
Celtics         626484
Steamrollers     12372
Ironmen           3674
Bombers          17793
Rebels            4474
Warriors        591224
Baltimore        37219
Jets              4482
Pistons         572758
Lakers          637444
Kings           569245
Hawks           567261
Denver            4818
Olympians        22864
Redskins          5372
Waterloo          4921
Packers           6193
Sixers          585891
Wizards         474809
Bulls           437269
Thunder         437735
Squires          91127
Stars            84940
Rockets         432504
Colonels         94435
Pacers          438288
Nuggets         445780
Spurs           453822
Spirits          85874
Sounds           75582
Floridians       49568
Nets            417809
Condors          49642
Bucks           418326
Suns            437486
Clippers        380523
Cavaliers       380416
Trailblazers    402695
Sails            30080
Jazz            363155
Mavericks       309239
Pelicans        220794
Heat            229103
Timberwolves    207693
Magic           219436
Grizzlies       157683
Raptors         158370
Hornets          84489
Name: pts, dtype: int64

## 4 - Cleaning Data

Cleaning, Normalizing, initializing are some of the required tasks over any Dataset

In [31]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysCPassed    126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB

### Missing Values

Avoid *null-values*

The current nba dataset has null  values (*Null/None/ Nan Values*).

The column "*motes*" has only 5424 *non-null* values. All remain columns have 126314 values..

Let analythe the following example:

In [32]:
#import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [25, 31, 22, None, 27],
        'Gender': ['F', 'M', None, 'M', 'F'],
        'Salary': [50000, None, 30000, 40000, 60000]}

df = pd.DataFrame(data)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     4 non-null      float64
 2   Gender  4 non-null      object
 3   Salary  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 288.0+ bytes

*It* is easy to realize that *Name* has 5  *non-null* values, but the other columns have only 4.

In [34]:
#preserve original datatset
dfCopy = df.copy()
dfCopy

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M      NaN
2  Charlie  22.0   None  30000.0
3    David   NaN      M  40000.0
4      Eva  27.0      F  60000.0

*Identify Missing Values*

The missing values are converted by default. The functions to identify these missing values are:

*   **isnull()**
*   **notnull()**


The output is a boolean value indicating whether the value that is passed into the argument is in fact missing data.

"True" means the value is a missing value while "False" means the value is not a missing value.

In [35]:
missing_data = dfCopy.isnull()
missing_data.head(5)

    Name    Age  Gender  Salary
0  False  False   False   False
1  False  False   False    True
2  False  False    True   False
3  False   True   False   False
4  False  False   False   False

### Replacing mising values

When *inplace=True* is passed, the data is renamed in place (it returns nothing), so you'd use:

*df.an_operation(inplace=True)*

When *inplace=False* is passed (this is the default value, so isn't necessary), performs the operation and returns a copy of the object, so you'd use:

*df = df.an_operation(inplace=False)*

Replace null values of *Age* feature by *Unknown*

In [36]:
dfCopy["Age"].fillna(\
                     value="Unknown",\
                     inplace=True)

In [37]:
dfCopy

      Name      Age Gender   Salary
0    Alice     25.0      F  50000.0
1      Bob     31.0      M      NaN
2  Charlie     22.0   None  30000.0
3    David  Unknown      M  40000.0
4      Eva     27.0      F  60000.0

*Replace null values by a particular value*

In [38]:
dfCopy.fillna({'Age':'Unknown', 'Gender': 'Other'}, inplace=True)

In [39]:
dfCopy

      Name      Age Gender   Salary
0    Alice     25.0      F  50000.0
1      Bob     31.0      M      NaN
2  Charlie     22.0  Other  30000.0
3    David  Unknown      M  40000.0
4      Eva     27.0      F  60000.0

In [40]:
display(dfCopy)

      Name      Age Gender   Salary
0    Alice     25.0      F  50000.0
1      Bob     31.0      M      NaN
2  Charlie     22.0  Other  30000.0
3    David  Unknown      M  40000.0
4      Eva     27.0      F  60000.0

Replace the "?" symbol with *NaN* so the dropna() can remove the missing values:

In [41]:
df1=dfCopy.replace('?',np.NaN)

Fill number features with the *mean* value

In [42]:
#reset dfCopy
dfCopy = df.copy()
#dfCopy
#dfCopy.info()

In [43]:
#Using Mode() function to input the values using fillna
dfCopy.fillna({'Salary':dfCopy['Salary'].mean()})

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M  45000.0
2  Charlie  22.0   None  30000.0
3    David   NaN      M  40000.0
4      Eva  27.0      F  60000.0

In [44]:
dfCopy

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M      NaN
2  Charlie  22.0   None  30000.0
3    David   NaN      M  40000.0
4      Eva  27.0      F  60000.0

Fill number features with the *mode* value

In [45]:
#Using Mode() function to inpute the values using fillna
dfCopy.fillna({'Salary':dfCopy['Salary'].mode()[0]}, inplace = True)

In [46]:
dfCopy

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M  30000.0
2  Charlie  22.0   None  30000.0
3    David   NaN      M  40000.0
4      Eva  27.0      F  60000.0

In [47]:
dfCopy.fillna({'Age':-1, 'Gender':'Other'}, inplace = True)

In [48]:
dfCopy

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M  30000.0
2  Charlie  22.0  Other  30000.0
3    David  -1.0      M  40000.0
4      Eva  27.0      F  60000.0

### See the *null* values

In [49]:
n1 = dfCopy.isnull().any(axis=1)
n1

0    False
1    False
2    False
3    False
4    False
dtype: bool

### Get only the *null* values

In [50]:
nullRows = dfCopy[n1]
nullRows

Empty DataFrame
Columns: [Name, Age, Gender, Salary]
Index: []

### Get only the *non-null* values

In [51]:
n2 = dfCopy.notnull().all(axis=1)
n2

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [52]:
nonNullRows = dfCopy[n2]
nonNullRows

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M  30000.0
2  Charlie  22.0  Other  30000.0
3    David  -1.0      M  40000.0
4      Eva  27.0      F  60000.0

### Checking *Null Values* using Query Method

In this example, the != operator compare the column values with themselves, which returns *True* if the value is *null*.

In [53]:
nullRows = dfCopy.query('Age != Age or Gender != Gender or Salary != Salary')

In [54]:
nullRows

Empty DataFrame
Columns: [Name, Age, Gender, Salary]
Index: []

###  Remove rows with missing values

The easiest way to deal with records containing missing values (incomplete records) is to ignore them!

In [55]:
dfCopy.shape
#dfCopy

(5, 4)

In [56]:
#default axis=0 (index==rows)
rowsWithoutMissingData = dfCopy.dropna()

In [57]:
rowsWithoutMissingData.shape

(5, 4)

In [58]:
rowsWithoutMissingData

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M  30000.0
2  Charlie  22.0  Other  30000.0
3    David  -1.0      M  40000.0
4      Eva  27.0      F  60000.0

### Remove *Features* with null-values

Remove problematic columns if they’re not relevant for your analysis.

In [59]:
#Features==Columns (axis 1)
dataWithoutMissingColumns = dfCopy.dropna(axis=1)

In [60]:
dataWithoutMissingColumns

      Name   Age Gender   Salary
0    Alice  25.0      F  50000.0
1      Bob  31.0      M  30000.0
2  Charlie  22.0  Other  30000.0
3    David  -1.0      M  40000.0
4      Eva  27.0      F  60000.0

In [61]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysCPassed    126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB

### Change *Null Values*

In [62]:
#see https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html
data_with_default_notes = nba.copy()
data_with_default_notes["notes"].fillna(value="no notes at all", inplace=True)
data_with_default_notes["notes"].describe()
# Expected:
# count              126314
# unique                232
# top       no notes at all
# freq               120890
# Name: notes, dtype: object

count              126314
unique                232
top       no notes at all
freq               120890
Name: notes, dtype: object

### Invalid Values

In [63]:
nba[nba["pts"] == 0]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played,DaysCPassed
26684,13343,197210260VIR,ABA,1,1973,10/26/1972,7,0,DNR,Nuggets,...,Squires,2,1484.1907,1487.083,A,L,0.328948,at Richmond VA; forfeit to VIR,1972-10-26,18717.0

### Inconsistencies Between Values in Different Columns

In [64]:
nba[(nba["pts"] > nba["opp_pts"]) & (nba["game_result"] != "W")].empty
# Expected:
# True

True

In [65]:
nba[(nba["pts"] < nba["opp_pts"]) & (nba["game_result"] != "L")].empty
# Expected:
# True

True

### Spliting Datasets



---

***Slicing Data (essential)***

In [66]:
a = [7, 2, 3, 7, 5, 6, 0, 1]

the instruction *[start:stop]* includes the value in the position *start*, but not in the position *stop*. Both are optional.

Part of the data

In [67]:
a[1:5]

[2, 3, 7, 5]

In [68]:
a[:5]

[7, 2, 3, 7, 5]

In [69]:
a[3:]

[7, 5, 6, 0, 1]

Start from the end of the data

In [70]:
a[-4:]

[5, 6, 0, 1]

In [71]:
a[-6:-2]

[3, 7, 5, 6]

*Values substituition*

In [72]:
a[3:4] = [6, 3]
a

[7, 2, 3, 6, 3, 5, 6, 0, 1]

*Change the step using [start:stop:step]*

In [73]:
a[::2]

[7, 3, 3, 6, 1]

*Special case: Inverting a sequence*

In [74]:
a[::-1]

[1, 0, 6, 5, 3, 6, 3, 2, 7]



---

**Considering Datasets**

*Spliting the Dataset by Row*

In [75]:
len(nba)

126314

*Splitting  Dataframe by groups*

Group the data by column value *year_id*. The newly formed dataframe consists of grouped data with *year_id* = 1947.

In [76]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 25 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
 23  date_played    126314 non-null  datetime64[ns]
 24  DaysCPassed    126314 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(10)
memory usage: 24.1+ MB

In [77]:
# splitting dataframe by groups
# grouping by year
grouped = nba.groupby(nba.year_id)
#get the group of 1947
df_new=grouped.get_group(1947)
df_new

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played,DaysCPassed
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN,1946-11-01,28208.0
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN,1946-11-01,28208.0
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN,1946-11-02,28207.0
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN,1946-11-02,28207.0
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN,1946-11-02,28207.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
695,348,194704190CHS,NBA,1,1947,4/19/1947,68,1,PHW,Warriors,...,Stags,72,1416.6769,1409.4009,A,W,0.389797,NaN,1947-04-19,28039.0
696,349,194704200CHS,NBA,1,1947,4/20/1947,69,1,PHW,Warriors,...,Stags,74,1409.4009,1412.5547,A,L,0.409896,NaN,1947-04-20,28038.0
697,349,194704200CHS,NBA,0,1947,4/20/1947,71,1,CHS,Stags,...,Warriors,73,1446.0986,1442.9448,H,W,0.590104,NaN,1947-04-20,28038.0
698,350,194704220GSW,NBA,1,1947,4/22/1947,72,1,CHS,Stags,...,Warriors,83,1442.9448,1446.1919,A,L,0.320694,NaN,1947-04-22,28036.0
699,350,194704220GSW,NBA,0,1947,4/22/1947,70,1,PHW,Warriors,...,Stags,80,1412.5547,1409.3076,H,W,0.679306,NaN,1947-04-22,28036.0

In [78]:
df_new.count()

gameorder        700
game_id          700
lg_id            700
_iscopy          700
year_id          700
date_game        700
seasongame       700
is_playoffs      700
team_id          700
fran_id          700
pts              700
elo_i            700
elo_n            700
win_equiv        700
opp_id           700
opp_fran         700
opp_pts          700
opp_elo_i        700
opp_elo_n        700
game_location    700
game_result      700
forecast         700
notes              0
date_played      700
DaysCPassed      700
dtype: int64

*Splitting Pandas Dataframe by sized chunks*

Randon 60%

In [79]:
# splitting dataframe in a particular size
df_split = nba.sample(frac=.6)
df_split.reset_index()
#df_split
len(df_split)

75788

Split  dataframe in different sets

In [80]:
#Shuffle the whole dataset first
ds3 = nba.copy()
ds3.sample(frac=1, random_state=42)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played,DaysCPassed
37090,18546,197702020NYN,NBA,0,1977,2/2/1977,48,0,NYN,Nets,...,Celtics,89,1454.9109,1444.0807,H,W,0.483096,NaN,1977-02-02,17157.0
7984,3993,195712030GSW,NBA,0,1958,12/3/1957,17,0,PHW,Warriors,...,Sixers,119,1532.4493,1557.2676,H,L,0.634248,at New York NY,1957-12-03,24158.0
74114,37058,199412030SEA,NBA,0,1995,12/3/1994,15,0,SEA,Thunder,...,Bucks,108,1357.6219,1356.7598,H,W,0.899416,NaN,1994-12-03,10644.0
94323,47162,200302180ORL,NBA,1,2003,2/18/2003,55,0,NOH,Pelicans,...,Magic,99,1455.0071,1460.9988,A,L,0.439981,NaN,2003-02-18,7645.0
37000,18501,197701230WSB,NBA,0,1977,1/23/1977,43,0,WSB,Wizards,...,Pistons,108,1518.8035,1512.1829,H,W,0.669820,NaN,1977-01-23,17167.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119879,59940,201302060OKC,NBA,0,2013,2/6/2013,49,0,OKC,Thunder,...,Warriors,98,1551.1230,1545.6824,H,W,0.807499,NaN,2013-02-06,4004.0
103694,51848,200612070NJN,NBA,1,2007,12/7/2006,17,0,PHO,Suns,...,Nets,157,1479.3242,1473.5780,A,W,0.536483,NaN,2006-12-07,6257.0
860,431,194801060BLB,NBA,1,1948,1/6/1948,21,0,PRO,Steamrollers,...,Baltimore,82,1433.5667,1437.2885,A,L,0.151443,NaN,1948-01-06,27777.0
15795,7898,196712130DET,NBA,1,1968,12/13/1967,31,0,NYK,Knicks,...,Pistons,129,1430.0306,1436.9717,A,L,0.327986,NaN,1967-12-13,20496.0
121958,60980,201312300DET,NBA,1,2014,12/30/2013,28,0,WAS,Wizards,...,Pistons,99,1427.9385,1418.0118,A,W,0.432347,NaN,2013-12-30,3677.0

In [81]:
ds3

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played,DaysCPassed
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN,1946-11-01,28208.0
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN,1946-11-01,28208.0
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN,1946-11-02,28207.0
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN,1946-11-02,28207.0
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN,1946-11-02,28207.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN,2015-06-11,3149.0
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN,2015-06-14,3146.0
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN,2015-06-14,3146.0
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN,2015-06-16,3144.0
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN,2015-06-16,3144.0

Split in two dataframes

In [82]:

list_of_dataframes = np.array_split(ds3, 2)
print("First:")
list_of_dataframes[0]
print('-'*100)
print("Second:")
list_of_dataframes[1]

First:
----------------------------------------------------------------------------------------------------
Second:

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played,DaysCPassed
63157,31579,199002060SAS,NBA,0,1990,2/6/1990,45,0,SAS,Spurs,...,Hawks,94,1477.7819,1471.8431,H,W,0.698796,NaN,1990-02-06,12405.0
63158,31580,199002070BOS,NBA,1,1990,2/7/1990,44,0,CHH,Pelicans,...,Celtics,146,1526.7374,1529.3101,A,L,0.099172,NaN,1990-02-07,12404.0
63159,31580,199002070BOS,NBA,0,1990,2/7/1990,46,0,BOS,Celtics,...,Pelicans,125,1243.4368,1240.8641,H,W,0.900828,NaN,1990-02-07,12404.0
63160,31581,199002070LAL,NBA,1,1990,2/7/1990,46,0,CHI,Bulls,...,Lakers,121,1673.3429,1679.2725,A,L,0.227701,NaN,1990-02-07,12404.0
63161,31581,199002070LAL,NBA,0,1990,2/7/1990,46,0,LAL,Lakers,...,Bulls,103,1561.1747,1555.2451,H,W,0.772299,NaN,1990-02-07,12404.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN,2015-06-11,3149.0
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN,2015-06-14,3146.0
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN,2015-06-14,3146.0
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN,2015-06-16,3144.0
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN,2015-06-16,3144.0

In [83]:
# spliting dataframe by row index
# last 1000 rows
df1 = nba.iloc[:1000,:]
# first 1000 rows
df2 = nba.iloc[1000:,:]
print(df1)
print("---------------------------")
print(df2)

     gameorder       game_id lg_id  _iscopy  year_id  date_game  seasongame  \
0            1  194611010TRH   NBA        0     1947  11/1/1946           1
1            1  194611010TRH   NBA        1     1947  11/1/1946           1
2            2  194611020CHS   NBA        0     1947  11/2/1946           1
3            2  194611020CHS   NBA        1     1947  11/2/1946           2
4            3  194611020DTF   NBA        0     1947  11/2/1946           1
..         ...           ...   ...      ...      ...        ...         ...
995        498  194802190GSW   NBA        1     1948  2/19/1948          36
996        499  194802190STB   NBA        1     1948  2/19/1948          39
997        499  194802190STB   NBA        0     1948  2/19/1948          36
998        500  194802210PRO   NBA        1     1948  2/21/1948          35
999        500  194802210PRO   NBA        0     1948  2/21/1948          40

     is_playoffs team_id       fran_id  ...      opp_fran  opp_pts  opp_elo_i  \
0              0     TRH       Huskies  ...        Knicks       68  1300.0000
1              0     NYK        Knicks  ...       Huskies       66  1300.0000
2              0     CHS         Stags  ...        Knicks       47  1306.7233
3              0     NYK        Knicks  ...         Stags       63  1300.0000
4              0     DTF       Falcons  ...      Capitols       50  1300.0000
..           ...     ...           ...  ...           ...      ...        ...
995            0     WSC      Capitols  ...      Warriors       84  1395.3289
996            0     PRO  Steamrollers  ...       Bombers       78  1443.3657
997            0     STB       Bombers  ...  Steamrollers       69  1219.4104
998            0     CHS         Stags  ...  Steamrollers       73  1217.3364
999            0     PRO  Steamrollers  ...         Stags       92  1446.4221

     opp_elo_n game_location game_result  forecast  notes  date_played  \
0    1306.7233             H           L  0.640065    NaN   1946-11-01
1    1293.2767             A           W  0.359935    NaN   1946-11-01
2    1297.0712             H           W  0.631101    NaN   1946-11-02
3    1309.6521             A           L  0.368899    NaN   1946-11-02
4    1320.3811             H           L  0.640065    NaN   1946-11-02
..         ...           ...         ...       ...    ...          ...
995  1404.0222             A           L  0.483214    NaN   1948-02-19
996  1445.4397             A           L  0.134140    NaN   1948-02-19
997  1217.3364             H           W  0.865860    NaN   1948-02-19
998  1208.0995             A           W  0.677668    NaN   1948-02-21
999  1455.6591             H           L  0.322332    NaN   1948-02-21

    DaysCPassed
0       28208.0
1       28208.0
2       28207.0
3       28207.0
4       28207.0
..          ...
995     27733.0
996     27733.0
997     27733.0
998     27731.0
999     27731.0

[1000 rows x 25 columns]
---------------------------
        gameorder       game_id lg_id  _iscopy  year_id  date_game  \
1000          501  194802210WSC   NBA        0     1948  2/21/1948
1001          501  194802210WSC   NBA        1     1948  2/21/1948
1002          502  194802220BOS   NBA        1     1948  2/22/1948
1003          502  194802220BOS   NBA        0     1948  2/22/1948
1004          503  194802220STB   NBA        1     1948  2/22/1948
...           ...           ...   ...      ...      ...        ...
126309      63155  201506110CLE   NBA        0     2015  6/11/2015
126310      63156  201506140GSW   NBA        0     2015  6/14/2015
126311      63156  201506140GSW   NBA        1     2015  6/14/2015
126312      63157  201506170CLE   NBA        0     2015  6/16/2015
126313      63157  201506170CLE   NBA        1     2015  6/16/2015

        seasongame  is_playoffs team_id    fran_id  ...   opp_fran  opp_pts  \
1000            37            0     WSC   Capitols  ...  Baltimore       72
1001            38            0     BLB  Baltimore  ...   Capitols       85
1002            36            0     CHS      Stags  ...    Celtics       77
1003            39            0     BOS    Celtics  ...      Stags       97
1004            41            0     NYK     Knicks  ...    Bombers       80
...            ...          ...     ...        ...  ...        ...      ...
126309         100            1     CLE  Cavaliers  ...   Warriors      103
126310         102            1     GSW   Warriors  ...  Cavaliers       91
126311         101            1     CLE  Cavaliers  ...   Warriors      104
126312         102            1     CLE  Cavaliers  ...   Warriors      105
126313         103            1     GSW   Warriors  ...  Cavaliers       97

        opp_elo_i  opp_elo_n game_location game_result  forecast  notes  \
1000    1458.3218  1450.7421             H           W  0.661831    NaN
1001    1474.9669  1482.5466             A           L  0.338169    NaN
1002    1268.3983  1256.8536             A           W  0.623003    NaN
1003    1455.6591  1467.2037             H           L  0.376997    NaN
1004    1445.4397  1452.3027             A           L  0.377121    NaN
...           ...        ...           ...         ...       ...    ...
126309  1790.9591  1809.9791             H           L  0.546572    NaN
126310  1704.3949  1700.7391             H           W  0.765565    NaN
126311  1809.9791  1813.6349             A           L  0.234435    NaN
126312  1813.6349  1822.2881             H           L  0.481450    NaN
126313  1700.7391  1692.0859             A           W  0.518550    NaN

        date_played DaysCPassed
1000     1948-02-21     27731.0
1001     1948-02-21     27731.0
1002     1948-02-22     27730.0
1003     1948-02-22     27730.0
1004     1948-02-22     27730.0
...             ...         ...
126309   2015-06-11      3149.0
126310   2015-06-14      3146.0
126311   2015-06-14      3146.0
126312   2015-06-16      3144.0
126313   2015-06-16      3144.0

[125314 rows x 25 columns]

In [88]:
df1

        gameorder       game_id lg_id
0               1  194611010TRH   NBA
1               1  194611010TRH   NBA
2               2  194611020CHS   NBA
3               2  194611020CHS   NBA
4               3  194611020DTF   NBA
...           ...           ...   ...
126309      63155  201506110CLE   NBA
126310      63156  201506140GSW   NBA
126311      63156  201506140GSW   NBA
126312      63157  201506170CLE   NBA
126313      63157  201506170CLE   NBA

[126314 rows x 3 columns]

*Spliting by Columns (Features)*

In [89]:
# Split the DataFrame using iloc[] by columns
# first 3 columns
df1 = nba.iloc[:,:3]
# last 3 columns
df2 = nba.iloc[:,3:]
print(df1)
print("---------------------------")
print(df2)

        gameorder       game_id lg_id
0               1  194611010TRH   NBA
1               1  194611010TRH   NBA
2               2  194611020CHS   NBA
3               2  194611020CHS   NBA
4               3  194611020DTF   NBA
...           ...           ...   ...
126309      63155  201506110CLE   NBA
126310      63156  201506140GSW   NBA
126311      63156  201506140GSW   NBA
126312      63157  201506170CLE   NBA
126313      63157  201506170CLE   NBA

[126314 rows x 3 columns]
---------------------------
        _iscopy  year_id  date_game  seasongame  is_playoffs team_id  \
0             0     1947  11/1/1946           1            0     TRH
1             1     1947  11/1/1946           1            0     NYK
2             0     1947  11/2/1946           1            0     CHS
3             1     1947  11/2/1946           2            0     NYK
4             0     1947  11/2/1946           1            0     DTF
...         ...      ...        ...         ...          ...     ...
126309        0     2015  6/11/2015         100            1     CLE
126310        0     2015  6/14/2015         102            1     GSW
126311        1     2015  6/14/2015         101            1     CLE
126312        0     2015  6/16/2015         102            1     CLE
126313        1     2015  6/16/2015         103            1     GSW

          fran_id  pts      elo_i      elo_n  ...   opp_fran opp_pts  \
0         Huskies   66  1300.0000  1293.2767  ...     Knicks      68
1          Knicks   68  1300.0000  1306.7233  ...    Huskies      66
2           Stags   63  1300.0000  1309.6521  ...     Knicks      47
3          Knicks   47  1306.7233  1297.0712  ...      Stags      63
4         Falcons   33  1300.0000  1279.6189  ...   Capitols      50
...           ...  ...        ...        ...  ...        ...     ...
126309  Cavaliers   82  1723.4149  1704.3949  ...   Warriors     103
126310   Warriors  104  1809.9791  1813.6349  ...  Cavaliers      91
126311  Cavaliers   91  1704.3949  1700.7391  ...   Warriors     104
126312  Cavaliers   97  1700.7391  1692.0859  ...   Warriors     105
126313   Warriors  105  1813.6349  1822.2881  ...  Cavaliers      97

        opp_elo_i  opp_elo_n  game_location  game_result  forecast notes  \
0       1300.0000  1306.7233              H            L  0.640065   NaN
1       1300.0000  1293.2767              A            W  0.359935   NaN
2       1306.7233  1297.0712              H            W  0.631101   NaN
3       1300.0000  1309.6521              A            L  0.368899   NaN
4       1300.0000  1320.3811              H            L  0.640065   NaN
...           ...        ...            ...          ...       ...   ...
126309  1790.9591  1809.9791              H            L  0.546572   NaN
126310  1704.3949  1700.7391              H            W  0.765565   NaN
126311  1809.9791  1813.6349              A            L  0.234435   NaN
126312  1813.6349  1822.2881              H            L  0.481450   NaN
126313  1700.7391  1692.0859              A            W  0.518550   NaN

        date_played DaysCPassed
0        1946-11-01     28208.0
1        1946-11-01     28208.0
2        1946-11-02     28207.0
3        1946-11-02     28207.0
4        1946-11-02     28207.0
...             ...         ...
126309   2015-06-11      3149.0
126310   2015-06-14      3146.0
126311   2015-06-14      3146.0
126312   2015-06-16      3144.0
126313   2015-06-16      3144.0

[126314 rows x 22 columns]

### Generate a new Dataset
After the dataset analysis it could be necessary to generate a new dataset.

In [90]:
#import os
#print(os.getcwd())

#filePath='/content/gDrive/MyDrive/MIA/ColabNotebooks/Datasets'
#f=dfCopy.to_csv(filePath+'newDataSet.csv', sep=';', index=False)
f=dfCopy.to_csv('newDataSet.csv', sep=';', index=False)

### Exporting only a few features

In [91]:
#or
#dfCopy.to_csv(filePath+'newDataSet2.csv',columns=['Age','Salary'])
dfCopy.to_csv('newDataSet2.csv',columns=['Age','Salary'])

End!